In [1]:
# 10.27 일 수업 대체 10장  pandas

In [2]:
# pandas 는 데이터베이스가 행과 열로 이루어진 것 
# 보통 약자로 pd로 한다

In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [17]:
import pandas as pd

In [18]:
test_dict={'corey':[63,75,88],'kevin':[48,98,92],'akshay':[87,86,85]}

In [19]:
df=pd.DataFrame(test_dict)

In [20]:
df

   corey  kevin  akshay
0     63     48      87
1     75     98      86
2     88     92      85

In [21]:
df=df.T             #행과 열이 바뀜
df

         0   1   2
corey   63  75  88
kevin   48  98  92
akshay  87  86  85

In [44]:
df.columns=['quiz_1','quiz_2','quiz_3']        #columns은 열로 세로이다
df

        quiz_1  quiz_2  quiz_3
corey       63      75      88
kevin       48      98      92
akshay      87      86      85

In [27]:
df.iloc[1]        #df.iloc[x]  x번째 행이 나온다

quiz_1    48
quez_2    98
quiz_3    92
Name: kevin, dtype: int64

In [26]:
df.iloc[0,:]     #첫번째 컬럼가져옴

quiz_1    63
quez_2    75
quiz_3    88
Name: corey, dtype: int64

In [28]:
df['quiz_1']

corey     63
kevin     48
akshay    87
Name: quiz_1, dtype: int64

In [30]:
df.quiz_1

corey     63
kevin     48
akshay    87
Name: quiz_1, dtype: int64

In [34]:
df.iloc[:,0]     #첫번째 컬럼가져옴

corey     63
kevin     48
akshay    87
Name: quiz_1, dtype: int64

In [45]:
rows=['corey','kevin']
cols=['quiz_2','quiz_3']
df_spring=df.loc[rows,cols]       #df.iloc 의 iloc은 숫자가 들어가야한다.
df_spring

       quiz_2  quiz_3
corey      75      88
kevin      98      92

In [47]:
df.iloc[[0,1],[1,2]]

       quiz_2  quiz_3
corey      75      88
kevin      98      92

In [49]:
df.iloc[0:2,1:3]

       quiz_2  quiz_3
corey      75      88
kevin      98      92

In [52]:
df['quiz_avg']=df.mean(axis=1)
df

        quiz_1  quiz_2  quiz_3   quiz_avg
corey       63      75      88  75.333333
kevin       48      98      92  79.333333
akshay      87      86      85  86.000000

In [53]:
df['quiz_4']=[92,98,77]
df

        quiz_1  quiz_2  quiz_3   quiz_avg  quiz_4
corey       63      75      88  75.333333      92
kevin       48      98      92  79.333333      98
akshay      87      86      85  86.000000      77

In [54]:
del df['quiz_avg']
df

        quiz_1  quiz_2  quiz_3  quiz_4
corey       63      75      88      92
kevin       48      98      92      98
akshay      87      86      85      77

In [63]:
import numpy as np
import pandas as pd
df_new= pd.DataFrame({'quiz_1':[np,NaN],'quiz_2':[np,NaN],'quiz_3':[np,NaN],'quiz_4':[71]}, index=['Adrian'])
df_new

NameError: name 'NaN' is not defined